app/Controllers/Dashboard.php

    public function index()
    {
        $userModel = new UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '12'