app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
---
    public function index()
    {
        $userModel = new UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);